package greedy;

import java.util.Arrays;

/**
 * 455.分发饼干
 *
 * 假设你是一位很棒的家长，想要给你的孩子们一些小饼干。但是，每个孩子最多只能给一块饼干。
 *
 * 对每个孩子 i，都有一个胃口值g[i]，这是能让孩子们满足胃口的饼干的最小尺寸；并且每块饼干 j，都有一个尺寸 s[j]。如果 s[j]>= g[i]，我们可以将这个饼干 j 分配给孩子 i ，这个孩子会得到满足。你的目标是尽可能满足越多数量的孩子，并输出这个最大数值。
 *
 * 示例1:
 *
 * 输入: g = [1,2,3], s = [1,1]
 * 输出: 1
 * 解释:
 * 你有三个孩子和两块小饼干，3个孩子的胃口值分别是：1,2,3。
 * 虽然你有两块小饼干，由于他们的尺寸都是1，你只能让胃口值是1的孩子满足。
 * 所以你应该输出1。
 *
 * 示例2:
 *
 * 输入: g = [1,2], s = [1,2,3]
 * 输出: 2
 * 解释:
 * 你有两个孩子和三块小饼干，2个孩子的胃口值分别是1,2。
 * 你拥有的饼干数量和尺寸都足以让所有孩子满足。
 * 所以你应该输出2.
 */
public class FindContentChildren {

    /**
     * 为了满足更多的小孩，大尺寸的饼干既可以满足胃口大的孩子也可以满足胃口小的孩子，
     * 那么应该优先满足胃口大的孩子
     * 这里的局部最优就是大饼干喂给胃口大的，充分利用饼干尺寸喂饱一个，全局最优就是喂饱尽可能多的小孩
     *
     * 先将小孩和饼干数组排序，然后从后向前遍历小孩数组，用大饼干优先满足胃口大的，并统计满足小孩数量
     *
     * 饼干：1  3  5  9
     *       /  /  /
     * 小孩：1  2  7  10
     *
     * T:O(nlogn)
     * S:O(1)
     */
    public int findContentChildren(int[] g, int[] s) {
        Arrays.sort(g);
        Arrays.sort(s);
        int j = s.length - 1;
        int result = 0;
        for (int i = g.length - 1; i >= 0; i--) {
            if (j >= 0 && s[j] >= g[i]) {
                result++;
                j--;
            }
        }
        return result;
    }

    /**
     * 方案2：先喂饱胃口小的小孩
     *
     * 先将小孩和饼干数组排序，然后从前往后遍历饼干数组，用小饼干优先满足小胃口的小孩，并统计满足小孩的数量
     *
     * 饼干：1  3  5  9
     *      |  |   /
     * 小孩：1  2  7  10
     *
     * T:O(nlogn)
     * S:O(1)
     */
    public int findContentChildren2(int[] g, int[] s) {
        Arrays.sort(g);
        Arrays.sort(s);
        int i = 0;
        int result = 0;
        for (int j = 0; j < s.length && i < g.length; j++) {
            if (s[j] >= g[i]) {
                result++;
                i++;
            }
        }
        return result;
    }
}
